<h1 class="c75 c35" id="h.6hjqys77brp0"><span class="c28 c87"></span></h1><h1 class="c95 c35" id="h.w69xvh7zteyu"><span class="c28 c87">Epis&oacute;dio 24: Conhecendo o m&oacute;dulo USART - Recep&ccedil;&atilde;o ass&iacute;ncrona e a interrup&ccedil;&atilde;o associada</span></h1><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Neste episodio, que &eacute; um complemento do episodio 23 (anterior) que trata da transmiss&atilde;o no modulo USART, vamos aprender a receber dados pelo modulo USART.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">COme&ccedil;aremos conhecendo o registrador RCSTA (Receive Status and Control Register) que fara o controle sobre o processo de recebimento de informa&ccedil;&otilde;es, visto na Figura X1</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c12"><span class="register">Figura X1 -</span><span class="c5">Registrador RCSTA</span></p><p class="c12"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 509.00px; height: 54.00px;"><img src="images/image48.png" style="width: 509.00px; height: 54.00px;" title=""></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Comecaremos pelo estudo do bit SPEN o qual &eacute; responsavel por ativar ou desativar a porta serial. Assim seo o bit SPEN for igual a 0 a porta serial est&aacute; desativada, ou se SPEN for igual a 1, a porta serial est&aacute; ativada.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">O bit RX9 &eacute; o bit de permiss&atilde;o para receber um 9&ordm; bit, onde se RX9 for igual a 0, seleciona recep&ccedil;&atilde;o de apenas 8 bits (1 byte), enquanto que, se RX9 for igual a 1, seleciona recep&ccedil;&atilde;o de dados de 9 bits.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span>O proximo bit &eacute; o bit SREN que &eacute; responsavel por permitir o recebimento unico de dados. Ese bit n&atilde;o tem utilidade no modo assincrono (que usaremos nos episodios), como tamb&eacute;m no modo sincrono como </span><span class="c37">Slave</span><span class="c5">.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span>No modo sincrono como </span><span class="c37">Master</span><span class="c5">, se o bit SREN for igual a 0, desativa o recebimento unico de dados, eqnaunto se SREN for igual a 1, ativa o recebimento unico. Este bit &eacute; limpo ap&oacute;s a recep&ccedil;&atilde;o estar completa.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">O bit CREN &eacute; o bit responsavel por ativar ou desativar a recep&ccedil;&atilde;o continua de dados e ele trabalha nos dois modos. Assim, se o modo assincroo estiver ativo, tem-se que a recep&ccedil;&atilde;o continua est&aacute; desativada se CREN for igual a 0 ou ser&aacute; ativada se CREN for igual a 1. Porem, se o modo sincrono estiver ativo, a recep&ccedil;&atilde;o continua de dados esta desativada se CREN for igual a 0, mas se CREN for igual a 1, ativa o recebimento (recep&ccedil;&atilde;o) continuo de dados enquanto o bit CREN est&aacute; limpado.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">O proximo bit a ser configurado &eacute; o bit ADEN o qual &eacute; responsavel por ativar o auto detectar enderecos. Esse bit n&atilde;o &eacute; usado no modo sincrono e nem no modo assincrono com 8 bits (bit RX9 igual a 0).</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">J&aacute; no modo assincrono com 9 bits (RX9 = 1), se ADEN for igual a 0, desativa detec&ccedil;&atilde;o de endereco, e assim todos os bits s&atilde;o recebidos, e o 9&ordm; bit pode ser usado como bit de paridade, mas se ADEN for igual a 1, ativa detec&ccedil;&atilde;o de endere&ccedil;o, ativa interrup&ccedil;&atilde;o e carrega do buffer de recep&ccedil;&atilde;o quando RSR&lt;8&gt; (bit de parada) est&aacute; setado.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span>O bit </span><span class="c39">FERR [verificar tradu&ccedil;&atilde;o correta] </span><span>&eacute; o bit de erro de enquadramento, no qual se esse bit for igual a 0 quer dizer que n&atilde;o houve erro de enquadramento, enquanto se </span><span class="c39">FERR[verificar tradu&ccedil;&atilde;o correta] </span><span class="c5">for igual a 1, n&atilde;o dize que houve erro de enquadramento (pode ser atualizado lendo o registrador RCREG e recever o proximo byte valido).</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span>O bit </span><span class="c39">OERR [verificar tradu&ccedil;&atilde;o correta]</span><span>&eacute; o bit de erro de ultrapassagem, onde ele ser&aacute; igual a 0 se n&atilde;o houve ultrapassagem, enquato se </span><span class="c39">OERR [verificar tradu&ccedil;&atilde;o correta]</span><span class="c5">for igual a 1, houve erro de ultrapassagem e le pode ser limpado, limpando o bit CREN.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">E por ultimo o bit RX9D que &eacute; o 9&ordm; bit de dados recebidos que pode ser um bit de paridade.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">O processo de recep&ccedil;&atilde;o &eacute; visto na Figura X2 e os dados s&atilde;o recebidos o pino RB1/RX.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c12"><span class="register">Figura X2 -</span><span class="c5">Diagrama de blocos de recep&ccedil;&atilde;o do modulo USART</span></p><p class="c11"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 604.72px; height: 504.00px;"><img src="images/image27.png" style="width: 604.72px; height: 504.00px;" title=""></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Como j&aacute; mencioado, trabalharemos no modo assincrono (bit SYNC do registrador TXSTA igual a 0) e quando esse modo &eacute; selecionado, fazemos uso da recep&ccedil;&atilde;o continua (bit CREN do registrador RCSTA igual a 1).</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Conforme o datasheet do microcontrolador PIC16F628A, o registrador RSR ( Receive (serial) Shift Register) &eacute; o cora&ccedil;&atilde;o do processo do recebimento dos dados.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Ap&oacute;s o microcontrolador receber o bit de parada, o dado recebido no registrador RSR &eacute; transferido para o registrador RCREG (se ele estiver vazio). Se o processo de transferencia da informa&ccedil;&atilde;o ocorrer com sucesso, o bit RCIF (bit de interrup&ccedil;&atilde;o do modulo USART relativo ao processo de recep&ccedil;&atilde;o e que est&aacute; contido no registrador PIR1) est&aacute; setado e pode ser feito o tratamento se os bits PEIE (INTCON&lt;2&gt;) e RCIE (PIE1&lt;6&gt;) estiverem setados. O bit RCIF &eacute; apenas de leitura e para ser limpo deve-se ler o registrador RCREG e estar vazio porteiormente.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">O registrador RCREG &eacute; um registrador duplo buferizado de 2 niveis de profundidade do tipo FIFO (First Input First Output - Primeiro ao entrar e Primeiro ao sair) no qual &eacute; possivel receber 2 bytes e o terceiro byte estara no registrador RSR.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Na detec&ccedil;&atilde;o do bit de parada do terceiro byte, se o registrador RCREG estiver cheio, ent&atilde;o o bit OERR (Overrun error - erro de ultrapassagem) ser&aacute; setado e a informa&ccedil;&atilde;o no registrador RSR ser&aacute; perdida.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Para recuperar 2 bytes do registrador RCREG, necessita paenas fazer a leitura da infirma&ccedil;&atilde;o duas vezes pois RCREG &eacute; um registrador de comportamento FIFO com dois nvieis.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">A limpeza do registrador OERR (Overrun error bit) &eacute; limpo via software como j&aacute; foi comentado na descri&ccedil;&atilde;o dele, isto &eacute;, o bit OERR ser&aacute; limpo ao limpar e setar o bit CREN.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Agora se o bit OERR est&aacute; setado, o conteudo do registrador RSR ser&aacute; transferido para o registrador RCREG e s&atilde;o inibidos, ent&atilde;o &eacute; essencial para limpar o bit de erro se est&aacute; setado.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">O bit de (Framming error) FERR est&aacute; setado se um bit de parar &eacute; detectado como limpo.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">O os bits FERR e o 9&ordm; bit recebido s&atilde;o buferizados na mesma forma como os dados recebidos.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Lendo o registrador RCREG, carregaremos os bits RX9D e FERR com novos valores, portanto &eacute; essencial para o usuario ler o registrador RCSTA antes do registrador RCREG na ordem para n&atilde;o perder as informa&ccedil;&otilde;es antigas dos bits FERR e RX9D.</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="c5">Conforme o datasheet, os passos para repec&ccedil;&atilde;o assincrona s&atilde;o:</span></p><p class="c11 c14"><span class="c5"></span></p><ol class="c80 lst-kix_xtmvr39jkk8q-0 start" start="1"><li><span class="c5">Configure TRISB1 (RB1/RX) e TRISB2 (RB2/TX) como pinos de entrada;</span></li><li><span>Inicialize o registrador SPBRG </span><span class="c39">(registrador para &hellip;)</span><span class="c5">para o apropriado baud rate. Se baud rate de alta velocidade &eacute; desejado &ldquo;sete&rdquo; o bit BRGH conforme epis&oacute;dio 23;</span></li><li><span class="c5">Ative a porta serial assincrona limpando o bit SYNC e setando o bit SPEN;</span></li><li><span class="c5">Se as interrup&ccedil;&otilde;es s&atilde;o desejadas, ent&atilde;o &ldquo;sete&rdquo; o bit RCIE;</span></li><li><span class="c5">Se o 9&ordm; bit &eacute; desejado, ent&atilde;o &ldquo;sete&rdquo; o bit RX9;</span></li><li><span class="c5">Ative a recep&ccedil;&atilde;o, setando o bit CREN;</span></li><li><span class="c5">O flag ser&aacute; setado quando a recep&ccedil;&atilde;o est&aacute; completa e a interrup&ccedil;&atilde;o ser&aacute; gerada se o bit RCIE for setado;</span></li><li><span class="c5">Ler o o conteudo do registrador RCSTA para receber o 9&ordm; digito (se habilitado) e tamb&eacute;m se qualquer erro ocorreu durante a recep&ccedil;&atilde;o;</span></li><li><span class="c5">Ler o registrador RCREG que cont&eacute;m o dado recebido de 8 bits;</span></li><li><span class="c5">Se um erro OERR ocorrer, limpa o erro pela limpeza e habilita&ccedil;&atilde;o do bit CREN.</span></li></ol><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="register">Exemplo 1:</span><span class="c5">Recebimento de comandos vindo do computador para ligar LEDs</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11"><span class="register">Exemplo 2:</span><span class="c5">Recebimento de dados de m&oacute;dulo GPS</span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><p class="c11 c14"><span class="c5"></span></p><hr style="page-break-before:always;display:none;">